src/cf/src/Documents/ВозвратПоставщикуНалоговый/ВозвратПоставщикуНалоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратПоставщикуНалоговый</name>
  <basedOn>Document.НалоговаяНакладнаяПокупка</basedOn>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоcтавщикамиНалоговый</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСвязанныхДокументов</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоступлениеТовара</name>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ВозвратПоставщикуНалоговый/Forms/ФормаДокумента/Module.bsl
#Область Обработчики_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подменю", Элементы.ТЧТовары.КоманднаяПанель);
	Если Не ТолькоПросмотр Тогда
		КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подбор", Элементы.ТЧТовары.КоманднаяПанель);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = Не СерииИРазмещениеКлиент.ПроверитьСоответствиеСерийТоварам(ЭтаФорма, Объект.ТЧТовары, Объект.ТЧСерии, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ДанныеКонтрагента = ОбщегоНазначенияВызовСервера.ПолучитьДанныеКонтрагента(Объект.Контрагент, Объект.Организация, Ложь, Объект.Дата);
	Объект.Договор = ДанныеКонтрагента.Договор;
КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	СерииИРазмещениеКлиент.УказатьСерии(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	ОснованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РаботаСДокументамиКлиент.ПроверитьКратностьЕдиницы(Элемент.ТекущиеДанные, Объект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередУдалением(Элемент, Отказ)
	Для Каждого Инд Из Элементы.ТЧТовары.ВыделенныеСтроки Цикл
		Стр = Объект.ТЧТовары.НайтиПоИдентификатору(Инд);
		РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", Стр.КодСтроки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыАвтоподбора = РаботаСДокументамиКлиент.ПараметрыАвтободбораНоменклатуры();
	ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования = Истина;
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка, ПараметрыАвтоподбора);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	ДанныеОтбора = Новый Структура("МестоХранения, Номенклатура, Характеристика", Объект.МестоХранения, ТекСтр.Номенклатура, ТекСтр.Характеристика); 
	СерииИРазмещениеКлиент.ВыбратьСериюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект), ДанныеОтбора,, ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ТЧКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура ОснованиеПриИзмененииНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Заполнить(Об.Основание);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбщуюКоманду(Команда)
	КомандыТабличныхЧастейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Количество") Тогда
		РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоПодбору(Объект, ВыбранноеЗначение, , Неопределено, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
